app/views/twines/index.html.erb

<H2> Average Temper at Day </H2>
 <%= line_chart Twine.group(:created_at).average(:temp) %>
---
SELECT AVG(`twines`.`temp`) AS average_temp, `twines`.`created_at` AS twines_created_at FROM `twines` GROUP BY `twines`.`created_at`
SELECT `twines`.* FROM `twines`