app/controllers/geoips_controller.rb

  def index
    @geoips = Geoip.all
---
SELECT `geoips`.* FROM `geoips`