app/controllers/map_controller.rb

  def index
    @geoips = Geoip.all
---
SELECT `geoips`.* FROM `geoips`