app/controllers/twines_controller.rb

SELECT `twines`.* FROM `twines`
---
  def index
    @twines = Twine.all

INSERT INTO `twines` (`locate`, `temp`, `created_at`, `updated_at`) VALUES ('Tokyo', 19, '2016-05-16 14:47:43', '2016-05-16 14:47:43')
---
  def create
    @twine = Twine.new(twine_params)

    respond_to do |format|
      if @twine.save